src/Catalogs/НастройкиАвтоматическойПечатиБазовые/НастройкиАвтоматическойПечатиБазовые.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НастройкиАвтоматическойПечатиБазовые</name>
  <attributes>
    <name>ОбъектМетаданных</name>
    <type>
      <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
      <types>CatalogRef.ИдентификаторыОбъектовРасширений</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КомандыПечати</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МенеджерПечати</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоКопий</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/НастройкиАвтоматическойПечатиБазовые/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура КомандыПечатиПредставлениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ЗначениеЗаполнено(Объект.ОбъектМетаданных) тогда
		ДанныеВыбора = СписокКомандПечатиОбъекта(Объект.ОбъектМетаданных);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандыПечатиПредставлениеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если Элементы.КомандыПечати.ТекущиеДанные = Неопределено тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.ОбъектМетаданных) тогда
		ТекущийЭлемент = Элементы.ОбъектМетаданных;
		Возврат;
	КонецЕсли;
	
	КомандыПечатиПредставлениеОбработкаВыбораНаСервере(ВыбранноеЗначение, Элементы.КомандыПечати.ТекущаяСтрока);
	
КонецПроцедуры

&НаСервере
Процедура КомандыПечатиПредставлениеОбработкаВыбораНаСервере(ВыбранноеЗначение, ИдентификаторСтроки)
	
	СтрокаКомандыПечати = Объект.КомандыПечати.НайтиПоИдентификатору(ИдентификаторСтроки);
	ЗаполнитьЗначенияСвойств(СтрокаКомандыПечати, ВыбранноеЗначение);
	СтрокаКомандыПечати.КоличествоКопий = 1;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектМетаданныхНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = МетаданныеОбъектаНачалоВыбораНаСервере();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СписокКомандПечатиОбъекта(ОбъектМетаданных)
	
	Возврат НастройкиАвтоматическойПечатиСервер.СписокКомандПечатиОбъекта(ОбъектМетаданных);
	
КонецФункции

&НаСервереБезКонтекста
Функция МетаданныеОбъектаНачалоВыбораНаСервере()
	
	Возврат НастройкиАвтоматическойПечатиСервер.СписокОбъектовМетаданных(Истина);
	
КонецФункции

&НаКлиенте
Процедура ОбъектМетаданныхПриИзменении(Элемент)
	
	Объект.КомандыПечати.Очистить();
	
КонецПроцедуры
